#+TITLE: 简明 PostgreSQL
#+LANGUAGE: zh-CN
#+AUTHOR: [[https://github.com/shynur][/谢骐/]]
#+HTML_HEAD: <style> table, th, td {border: 1px solid;} code {box-sizing: border-box; display: inline-block; background-color: #F3F5F9; color: #0ABF5B} </style>

**** TODO ~MIN~ 函数和 ~MAX~ 函数

同样地, 这两个函数预先排除了 ~NULL~:

#+BEGIN_SRC sql
  SELECT MIN(sale_price),
         MAX(purchase_price)
  FROM Products;
#+END_SRC

N.b., ~MIN~​/​~MAX~ 函数 跟 ~AVG~​/​~SUM~ 函数 对参数类型有不同的要求:
~AVG~​/​~SUM~ 函数只能对​_数值类型_​的列使用, 而 ~MIN~​/​~MAX~ 函数原则上可以用于​_任何数据类型_​的列.
E.g.,

# TODO 不知为何, 该代码块的结果没有被导出.
#+BEGIN_SRC sql :exports both
  SELECT MIN(regist_date),
         MAX(regist_date)
  FROM Products;
#+END_SRC

#+RESULTS:
|        min |        max |
|------------+------------|
| 2008-04-28 | 2009-11-11 |

只要是能够排序的数据, 就肯定有最值, 也就能够使用这俩函数.
对日期来说, 平均值 和 合计值 并没有实际意义, 因此不能使用 ~AVG~​/​~SUM~ 函数.
这个观点对于字符串类型的数据也适用.

*** 向聚合函数传入互异的参数

#+CAPTION: 计算去重后的数据行数
#+BEGIN_SRC sql
  SELECT COUNT(DISTINCT product_type) AS "品类数目"
  FROM Products;
#+END_SRC

#+RESULTS:
| 品类数目 |
|------------|
| 3        |

这里 ~DISTINCT~ 写在括号中, 是因为必须要在计算行数之前删除 =product_type= 列中的重复数据.
如果像[[SELECT_DISTINCT的用法][~SELECT DISTINCT~ 语句]]那样写在括号外的话, 就会先计算出数据行数, 再删除重复数据, 最终得到的是 =product_type= 列的所有行数:

#+CAPTION: 先计算行数, 再删除重复的结果
#+BEGIN_SRC sql
  SELECT DISTINCT COUNT(product_type)
  FROM Products;
#+END_SRC

#+RESULTS:
| count |
|-------|
|     8 |

** 对表进行分组

我们可以用 ~GROUP BY~ 子句像这样:

#+CAPTION: 根据品类对商品进行分组
#+BEGIN_EXAMPLE
| (厨房用具) |   (衣服)   |
|            |    T恤衫   |
|   菜刀     |   运动T恤  |
|   高压锅   +------------|
|   叉子     | (办公用品) |
|   擦菜板   |   打孔器   |
|            |   圆珠笔   |
#+END_EXAMPLE

对表进行切分, e.g.,

#+BEGIN_SRC sql
  SELECT product_type,
         COUNT(*) AS "该品类含有多少种商品"
  FROM Products
  GROUP BY product_type;
#+END_SRC

#+RESULTS:
| product_type | 该品类含有多少种商品 |
|--------------+------------------------|
| 衣服         | 2                    |
| 办公用品     | 2                    |
| 厨房用具     | 4                    |

在 ~GROUP BY~ 子句中指定的列称为​_聚合键_​/​_分组列_.
和 ~SELECT~ 子句一样, <<~GROUP BY~ 多列>> 可以通过逗号分隔以指定多列, 这些列的组合决定分组的方式.

N.b., ~GROUP BY~ 子句一定要写在 ~FROM~ (and if existing ~WHERE~) 子句之后[fn:SQL书写顺序].

*** 聚合键是 ~NULL~ 的情况

#+BEGIN_SRC sql :exports both
  SELECT regist_date /* 含 NULL */,
         COUNT(*) AS "该日登记的商品数目"
  FROM Products
  GROUP BY regist_date;
#+END_SRC

#+RESULTS:
| regist_date | 该日登记的商品数目 |
|-------------+----------------------|
|             | 1                  |
|  2009-11-11 | 1                  |
|  2009-09-20 | 3                  |
|  2009-09-11 | 1                  |
|  2009-01-15 | 1                  |
|  2008-04-28 | 1                  |

从结果可以看出, 当聚合键中包含 ~NULL~ 时, 也会将其作为一组特定的数据[fn:: 其实这是容易推理出来的, [[~GROUP BY~ 多列][前文]]说过, ~GROUP BY~ 子句可以指定多个分组列.  如果这些列的某一种组合中包含一个 ~NULL~ 列, 从情理上讲, 我们当然不应该舍弃这种组合; 而按照单列进行分组, 不过是按照多列的组合来进行分组的一种特例.].

*** 先过滤再分组

有 ~WHERE~ 子句时, 会先根据它指定的条件进行过滤, 然后再进行汇总.
E.g.,

#+BEGIN_SRC sql
  SELECT purchase_price,
         COUNT(*)
  FROM Products
  WHERE product_type = '衣服'
  GROUP BY purchase_price;
#+END_SRC

#+RESULTS:
| purchase_price | count |
|----------------+-------|
|            500 |     1 |
|           2800 |     1 |

总结一下上述 SQL 语句的执行顺序[fn:: 这与语法所规定的书写顺序并不相同.  就是这样的, 书写顺序 和 RDBMS 内部的执行顺序并不相同.]:
~FROM~ \to ~WHERE~ \to ~GROUP BY~ \to ~SELECT~.

